////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	БазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	ИмяМакета = ?(БазаФайловая, "ПорядокОбновленияДляФайловойБазы", "ПорядокОбновленияДляКлиентСервернойБазы");
	
	Постфикс = ?(Параметры.ОбновлениеНа83 Или ОбщегоНазначенияКлиентСервер.ЭтоПлатформа83(), "83", "");
	
	ПолноеИмяМакета = "[ИмяМакета][Постфикс]";
	ПолноеИмяМакета = СтрЗаменить(ПолноеИмяМакета, "[ИмяМакета]", ИмяМакета);
	ПолноеИмяМакета = СтрЗаменить(ПолноеИмяМакета, "[Постфикс]", Постфикс);
	
	МакетПорядокОбновления = Обработки.НерекомендуемаяВерсияПлатформы.ПолучитьМакет(ПолноеИмяМакета);
	
	ПорядокОбновленияПрограммы = МакетПорядокОбновления.ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ПорядокОбновленияПрограммыПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Статус = ОбщегоНазначенияКлиент.ПредложитьУстановкуРасширенияРаботыСФайлами();
	СтандартнаяОбработка = Ложь;
	Если Статус = "Подключено" Тогда
		Если ДанныеСобытия.Href <> Неопределено Тогда
			ЗапуститьПриложение(ДанныеСобытия.Href);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
